AUTO_config_TK_pesok/src/DataProcessors/РазбиениеННПоСумме/РазбиениеННПоСумме.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РазбиениеННПоСумме</name>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ТК_НалоговаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерхнийПорог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НижнийПорог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/Enums/ВидыКонтрагентов/ВидыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтрагентов</name>
  <comment>Виды контрагентов</comment>
  <enumValues>
    <name>Покупатель</name>
    <comment>Основное взаимодествие с контрагентом - продажа, передача на комиссию, хранение</comment>
  </enumValues>
  <enumValues>
    <name>Поставщик</name>
    <comment>Основное взаимодествие с контрагентом - закупка и принятие на комиссию, хранение</comment>
  </enumValues>
  <enumValues>
    <name>ПодотчетноеЛицо</name>
    <comment>Подотчетное лицо компании</comment>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
    <comment>Филиал компании, одна из организаций</comment>
  </enumValues>
  <enumValues>
    <name>Собственник</name>
    <comment>Собственник компании, осуществляющий финансирование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочие контрагенты</comment>
  </enumValues>
  <enumValues>
    <name>Внутренний</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Enums/ВидыДоговоров/ВидыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоров</name>
  <comment>Виды договоров</comment>
  <enumValues>
    <name>Покупка</name>
    <comment>Договоры с поставщиками</comment>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
    <comment>Договоры с покупателями</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
    <comment>Договор комиссии</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
    <comment>Договор начисления бонусов</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Общий договор</comment>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяКомиссия</name>
    <comment>Упрощенная комиссия</comment>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Бартерный</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Enums/ВидыДвижений/ВидыДвижений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвижений</name>
  <comment>Виды движений</comment>
  <enumValues>
    <name>Приход</name>
    <comment>Приход</comment>
  </enumValues>
  <enumValues>
    <name>Расход</name>
    <comment>Расход</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее движения</comment>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Documents/КонсолидированныеОстаткиОрганизации/КонсолидированныеОстаткиОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонсолидированныеОстаткиОрганизации</name>
  <basedOn>Document.ТК_НалоговаяНакладная</basedOn>
  <basedOn>Document.ТК_Приложение2КНалоговойНакладной</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиОрганизации</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Поставщик/комитент от которого мы получили товар</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорВзаиморасчетов</name>
    <comment>Договор по которому ведутся взаиморасчеты с контрагентом</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВхДокНомер</name>
    <comment>Номер входящего документа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВхДокДата</name>
    <comment>Дата входящего документа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерRB</name>
    <comment>Номер Open Store</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусRB</name>
    <comment>Статус выгрузки в Open Store</comment>
    <type>
      <types>EnumRef.СтатусыВыгрузкиRB</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДДокументаОтгрузки</name>
    <comment>ID документа отгрузки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЦеныИзПротоколов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Таблица товаров и услуг</comment>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидыДвижений</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовое</name>
      <comment>Количество номенклатуры в базовых единицах (коэффициент=1)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНалогов</name>
      <comment>Цена без налогов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <comment>Итоговая сумма по строке документа со всеми налогами</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС по номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС по номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНалогов</name>
      <comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <comment>Процент скидки на продаваемый товар</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <comment>Сумма скидки по строке документа</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатурыОрганизаций</name>
      <type>
        <types>CatalogRef.ТК_КлючиАналитикиУчетаНоменклатурыОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/DataProcessors/РазбиениеННПоСумме/ObjectModule.bsl
&НаСервере
Процедура РазбитьНаСервере() Экспорт
	
	ФормаОбъекта = Документ;
	ТаблицаТовары = Документ.Товары;
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	Если НижнийПорог >= ТаблицаТовары.Итог("СуммаВсего") Тогда
		ОбщегоНазначения.СообщитьПользователю("Сумма Налоговой и так меньше порога, разбивать незачем !!!");
		Возврат
	ИначеЕсли ТаблицаТовары.Количество()=1 И (ТаблицаТовары[0].Количество=1 Или НижнийПорог<ТаблицаТовары[0].Цена) Тогда
		ОбщегоНазначения.СообщитьПользователю("Разбивка автоматически невозможна ! Попробуйте разбить вручную !!!");
		Возврат
	КонецЕсли;
	
	КопияТовары = ТаблицаТовары.Выгрузить();
	СуммаДокумента = 0;
	СуммаНакладных = 0;
	Попытка
		НачатьТранзакцию();
		
		//КонсолидированныеОстаткиОрганизации(Документ);
		ОбъектНН = ФормаОбъекта.Скопировать();
		ОбъектНН.Дата = ФормаОбъекта.Дата;
		ОбъектНН.УстановитьНовыйНомер();
		ОбъектНН.ДокументОснование = ФормаОбъекта.ДокументОснование;
		ОбъектНН.Комментарий = "Создан разбиением из '"+Документ+"'";
		ОбъектНН.Товары.Очистить();
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС"); 
		СтруктураДействий.Вставить("ПересчитатьСуммуВсегоНДС");
		СтруктураДействий.Вставить("ПересчитатьСуммуВсего");

		Для Каждого стрТТНН Из КопияТовары Цикл
			ПорогСуммы = ГСЧ.СлучайноеЧисло(НижнийПорог, ВерхнийПорог); 
			
			НоваяСтрока = ОбъектНН.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,стрТТНН);
			НоваяСтрока.НомерСтрокиНН = НоваяСтрока.НомерСтроки; 
			СуммаДокумента = СуммаДокумента + НоваяСтрока.СуммаВсего;
			
			Если ПорогСуммы<=СуммаДокумента Тогда
				Пока ПорогСуммы<=СуммаДокумента Цикл
					НужноеКоличество = Цел((ПорогСуммы-СуммаДокумента+НоваяСтрока.СуммаВсего)/(НоваяСтрока.СуммаВсего/НоваяСтрока.Количество));
					ОстатокКоличества = НоваяСтрока.Количество - НужноеКоличество;
					Цена = НоваяСтрока.Цена;
					Если НужноеКоличество > 0 Тогда 
						НоваяСтрока.Количество = НужноеКоличество;	
						ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
					Иначе
						Если ОбъектНН.Товары.Количество()=1 И ПорогСуммы<Цена Тогда
							ОбщегоНазначения.СообщитьПользователю("Т.к цена позиции больше порога, строку не дробим !!!");
							ОбъектНН.Записать(РежимЗаписиДокумента.Проведение);
							//КонсолидированныеОстаткиОрганизации(ОбъектНН.Ссылка);
							ОбщегоНазначения.СообщитьПользователю(Строка(ОбъектНН)+" на сумму "+Формат(ОбъектНН.СуммаДокумента,"ЧДЦ=2"));
							СуммаНакладных = СуммаНакладных + ОбъектНН.СуммаДокумента;
							Если КопияТовары.Индекс(стрТТНН) <> КопияТовары.Количество()-1 Тогда
								СуммаДокумента = 0;
								ОбъектНН = ФормаОбъекта.Скопировать();
								ОбъектНН.Дата = ФормаОбъекта.Ссылка.Дата;
								ОбъектНН.УстановитьНовыйНомер();
								ОбъектНН.ДокументОснование = ФормаОбъекта.ДокументОснование;
								ОбъектНН.Комментарий = "Создан разбиением из '"+Документ+"'";
								ОбъектНН.Товары.Очистить();
							КонецЕсли;
							Прервать;
						Иначе
							ОбъектНН.Товары.Удалить(НоваяСтрока);
							
							ОбъектНН.Записать(РежимЗаписиДокумента.Проведение);
							ОбщегоНазначения.СообщитьПользователю(Строка(ОбъектНН)+" на сумму "+Формат(ОбъектНН.СуммаДокумента,"ЧДЦ=2"));
							СуммаНакладных = СуммаНакладных + ОбъектНН.СуммаДокумента;

							ОбъектНН = ФормаОбъекта.Скопировать();
							ОбъектНН.Дата = ФормаОбъекта.Ссылка.Дата;
							ОбъектНН.УстановитьНовыйНомер();
							ОбъектНН.ДокументОснование = ФормаОбъекта.ДокументОснование;
							ОбъектНН.Комментарий = "Создан разбиением из '"+Документ+"'";
							ОбъектНН.Товары.Очистить();
							
							НоваяСтрока = ОбъектНН.Товары.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока,стрТТНН);
							СуммаДокумента = НоваяСтрока.СуммаВсего;
							Прервать;
						КонецЕсли;
					КонецЕсли;
					ОбъектНН.Записать(РежимЗаписиДокумента.Проведение);
					ОбщегоНазначения.СообщитьПользователю(Строка(ОбъектНН)+" на сумму "+Формат(ОбъектНН.СуммаДокумента,"ЧДЦ=2"));
					СуммаНакладных = СуммаНакладных + ОбъектНН.СуммаДокумента;
					
					ОбъектНН = ФормаОбъекта.Скопировать();
					//КонсолидированныеОстаткиОрганизации(ОбъектНН.Ссылка);
					//ПорогСуммы = ГСЧ.СлучайноеЧисло(НижнийПорог, ВерхнийПорог);
					ОбъектНН.Дата = ФормаОбъекта.Ссылка.Дата;
					ОбъектНН.УстановитьНовыйНомер();
					ОбъектНН.Комментарий = "Создан разбиением из '"+Документ+"'";
					ОбъектНН.ДокументОснование = ФормаОбъекта.ДокументОснование;
					ОбъектНН.Товары.Очистить();
					НоваяСтрока = ОбъектНН.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,стрТТНН);
					НоваяСтрока.Количество = ОстатокКоличества;	
					НоваяСтрока.Цена = Цена;	
					ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
					СуммаДокумента = НоваяСтрока.СуммаВсего;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(ОбъектНН.Ссылка) Тогда
			ОбъектНН.Записать(РежимЗаписиДокумента.Проведение);
			//КонсолидированныеОстаткиОрганизации(ОбъектНН.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(Строка(ОбъектНН)+" на сумму "+Формат(ОбъектНН.СуммаДокумента,"ЧДЦ=2"));
			СуммаНакладных = СуммаНакладных + ОбъектНН.СуммаДокумента;
		КонецЕсли;
		
		НН = ФормаОбъекта.Ссылка.ПолучитьОбъект();
		НН.ПометкаУдаления = Истина;
		НН.Записать(РежимЗаписиДокумента.ОтменаПроведения);

		ЗафиксироватьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю("Обработка завершена !  "+Формат(НН.СуммаДокумента,"ЧДЦ=2")+" и "+Формат(СуммаНакладных,"ЧДЦ=2"));
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	
КонецПроцедуры

Процедура КонсолидированныеОстаткиОрганизации(СсылкаНН)
	
	Если СсылкаНН.ХозОперация = Справочники.ХозОперации.НалоговаяНакладнаяОбыкновенняПродажа ИЛИ СсылкаНН.ХозОперация = Справочники.ХозОперации.НалоговаяНакладная Тогда
		Если СсылкаНН.Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Внутренний Тогда
			ОргДляОтгр = Справочники.Организации.НайтиПоРеквизиту("КодПоЕДРПОУ",СсылкаНН.Контрагент.КодПоЕДРПОУ);
			Если ОргДляОтгр =   Справочники.Организации.ПустаяСсылка() Тогда Возврат; КонецЕсли;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДоговорыКонтрагентов.Подразделение КАК Подразделение,
			|	ДоговорыКонтрагентов.Организация КАК Организация
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	ДоговорыКонтрагентов.Организация = &Организация
			|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
			|	И ДоговорыКонтрагентов.ВидДоговора.ВидДоговора = &ВидДоговора";
			
			Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоров.Покупка);
			Запрос.УстановитьПараметр("Контрагент", СсылкаНН.Организация.Контрагент);
			Запрос.УстановитьПараметр("Организация", ОргДляОтгр);
			
			РезВыборка = Запрос.Выполнить().Выбрать();
			Если РезВыборка.Следующий() Тогда
				ПодрДляОтгр = РезВыборка.Подразделение;
				ОргДоговора = РезВыборка.Организация;
			Иначе
				Возврат;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонсолидированныеОстаткиОрганизации.Ссылка,
			|	КонсолидированныеОстаткиОрганизации.ПометкаУдаления
			|ИЗ
			|	Документ.КонсолидированныеОстаткиОрганизации КАК КонсолидированныеОстаткиОрганизации
			|ГДЕ
			|	КонсолидированныеОстаткиОрганизации.ИДДокументаОтгрузки = &ИДДокументаОтгрузки";
			
			Запрос.УстановитьПараметр("ИДДокументаОтгрузки", Строка(СсылкаНН.УникальныйИдентификатор()));
			
			
			тзПодчиненные = Запрос.Выполнить().Выгрузить();
			
			Если СсылкаНН.ПометкаУдаления Тогда
				Для Каждого стзПодчиненные Из тзПодчиненные Цикл 
					Если НЕ стзПодчиненные.ПометкаУдаления тогда
						КООу = стзПодчиненные.Ссылка.ПолучитьОбъект();
						КООу.УстановитьПометкуУдаления(Истина);
					КонецЕсли;
				КонецЦикла;
			Иначе
				Если тзПодчиненные.Количество()=0 Тогда
					КОО = Документы.КонсолидированныеОстаткиОрганизации.СоздатьДокумент();
				Иначе 
					КОО = тзПодчиненные[0].Ссылка.ПолучитьОбъект();
					КОО.Товары.Очистить();
					Если КОО.ПометкаУдаления тогда
						КОО.УстановитьПометкуУдаления(Ложь);
					КонецЕсли;
					
					Для Сч=2 По тзПодчиненные.Количество() Цикл 
						стзПодчиненные = тзПодчиненные[Сч-1];
						Если НЕ стзПодчиненные.ПометкаУдаления тогда
							КООу = стзПодчиненные.Ссылка.ПолучитьОбъект();
							КООу.УстановитьПометкуУдаления(Истина);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				КОО.УстановитьВремя(РежимАвтоВремя.Первым);
				КОО.ХозОперация = Справочники.ХозОперации.КонсолидированныеПоступленияОрганизации;
				КОО.Дата = СсылкаНН.Дата;
				КОО.УстановитьНовыйНомер();
				КОО.ПодразделениеКомпании =ПодрДляОтгр; 
				КОО.Организация = ОргДоговора;
				КОО.Контрагент = СсылкаНН.Организация.Контрагент;
				КОО.Автор = СсылкаНН.Автор;
				КОО.ДоговорВзаиморасчетов = СсылкаНН.ДоговорВзаиморасчетов; 
				КОО.Заполнить(Неопределено);
				КОО.ИДДокументаОтгрузки = СсылкаНН.УникальныйИдентификатор();
				
				Для Каждого СтрТ ИЗ СсылкаНН.Товары Цикл 
					Строка = КОО.Товары.Добавить();
					Строка.ВидДвижения					= Перечисления.ВидыДвижений.Приход;
					Строка.Номенклатура					= СтрТ.Номенклатура;
					Строка.ХарактеристикаНоменклатуры	= СтрТ.ХарактеристикаНоменклатуры;
					Строка.Коэффициент					= СтрТ.Коэффициент;
					Строка.КоличествоБазовое			= СтрТ.Количество*СтрТ.Коэффициент;
					Строка.ЕдиницаИзмерения				= СтрТ.ЕдиницаИзмерения;
					Строка.СтавкаНДС					= СтрТ.СтавкаНДС;
					Строка.Количество					= Стрт.Количество;
					Строка.Сумма						= СтрТ.СуммаВсего;
					Строка.СуммаНДС						= Стрт.СуммаНДС;
					Строка.СуммаВсего					= СтрТ.СуммаВсего;
					Строка.Цена							= СтрТ.Цена;
					Строка.СуммаБезНалогов				= СтрТ.СуммаВсего - СтрТ.СуммаНДС;
					Строка.ЦенаБезНалогов				= (СтрТ.СуммаВсего - СтрТ.СуммаНДС)/(СтрТ.Количество*СтрТ.Коэффициент);
				КонецЦикла;
				
				Попытка
					КОО.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);	
				Исключение
					Сообщить("Ошибка проведения документа "+КОО+" пробуем записать");
					Попытка
						КОО.Записать();
					Исключение
					КонецПопытки;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
